servicemix-osgi/secure-proxy/1K_buyStocks_secure.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="id-1350214323161107000-484702535"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">Xeg55vRyK3ZhAEhEf+YT0z986L0=</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>JcmzUz8Eaf5jw8dhFPYATb3kvAOH8TtE8vnPXkC99tr30BCOip3UurSE6P58yftIh6K+n82KSmNp
CNzMB77htQJq+TSgJcUsKfjFvKyN9ZA/dOtAnX145K79v/XZBvGtR2TGFVnkevFmrDnrse3kqDEy
3OKXqgAV9rX/ZhMnPWI=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#id-1350214323161278000-563177234"/></xenc:ReferenceList></xenc:EncryptedKey><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-1350214323160711000-1761862004">MIIDDDCCAfSgAwIBAgIQM6YEf7FVYx/tZyEXgVComTANBgkqhkiG9w0BAQUFADAwMQ4wDAYDVQQK
DAVPQVNJUzEeMBwGA1UEAwwVT0FTSVMgSW50ZXJvcCBUZXN0IENBMB4XDTA1MDMxOTAwMDAwMFoX
DTE4MDMxOTIzNTk1OVowQjEOMAwGA1UECgwFT0FTSVMxIDAeBgNVBAsMF09BU0lTIEludGVyb3Ag
VGVzdCBDZXJ0MQ4wDAYDVQQDDAVBbGljZTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAoqi9
9By1VYo0aHrkKCNT4DkIgPL/SgahbeKdGhrbu3K2XG7arfD9tqIBIKMfrX4Gp90NJa85AV1yiNsE
yvq+mUnMpNcKnLXLOjkTmMCqDYbbkehJlXPnaWLzve+mW0pJdPxtf3rbD4PS/cBQIvtpjmrDAU8V
sZKT8DN5Kyz+EZsCAwEAAaOBkzCBkDAJBgNVHRMEAjAAMDMGA1UdHwQsMCowKKImhiRodHRwOi8v
aW50ZXJvcC5iYnRlc3QubmV0L2NybC9jYS5jcmwwDgYDVR0PAQH/BAQDAgSwMB0GA1UdDgQWBBQK
4l0TUHZ1QV3V2QtlLNDm+PoxiDAfBgNVHSMEGDAWgBTAnSj8wes1oR3WqqqgHBpNwkkPDzANBgkq
hkiG9w0BAQUFAAOCAQEABTqpOpvW+6yrLXyUlP2xJbEkohXHI5OWwKWleOb9hlkhWntUalfcFOJA
gUyH30TTpHldzx1+vK2LPzhoUFKYHE1IyQvokBN2JjFO64BQukCKnZhldLRPxGhfkTdxQgdf5rCK
/wh3xVsZCNTfuMNmlAM6lOAg8QduDah3WFZpEA0s2nwQaCNQTNMjJC8tav1CBr6+E5FAmwPXP7pJ
xn9Fw9OXRyqbRA4v2y7YpbGkG2GI9UvOHw6SGvf4FRSthMMO35YbpikGsLix3vAsXWWi4rwfVOYz
QK0OFPNi9RMCUdSH06m9uLWckiCxjos0FQODZE9l4ATGy9s9hNVwryOJTw==</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#id-1350214323156891000-876552083">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>JCep/mrufS/jgbZgAJ+L4/wWYrU=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#id-1350214323156364000-619836133">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>sHqGBh5mJuzgyioR174xndnjSB8=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
dciqZW7h3kS3GZ+m+NxsfJ26sph24UOjmFJyZjHS3tsqU8roIWfcRJhLd6yskCHpzvxFWvOeCWQW
JLvWCkbkJRmKj5LiS9Mr/qSrqdtuHpuRUOc+nrR+Vtd7r1uY0nrvvDe8rrVuVmsRNDzhRh4Bsvxg
eIPv9O5yJCegw91Tn5I=
</ds:SignatureValue>
<ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#id-1350214323160711000-1761862004" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-1350214323156364000-619836133"><wsu:Created>2012-10-14T11:32:03.156Z</wsu:Created><wsu:Expires>2012-11-13T11:32:03.156Z</wsu:Expires></wsu:Timestamp></wsse:Security><routing xmlns="http://someuri">xadmin;server1;community#1.0##</routing></soapenv:Header>
<soapenv:Body wsu:Id="id-1350214323156891000-876552083" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="id-1350214323161278000-563177234" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference URI="#id-1350214323161107000-484702535"/></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>IDzjUvA0NdCBeWhz6qGjxd4+En+JUQ5lx/6ZYNo+iBof3XC0VqKOzS6wb5TdgqBduhyyDMYsJ3O0
rtMmU+4jbkLnsI+cW3f13Bamd5gHk/+TUKxr0TpWCKNbakx4dqM9E2ibNDpXCutJbPayGZ/mhNuX
JRx+phudeDvCkg6LzmC1dc41Pnfu9AS7i8KePv3txNKGoIF2Io8Tq9VVLrCFJpxsAr4H+72qffTT
sCsBV+v2L65+YHdPgK/sfwb5yHBHQ3dFdkeTZG/E/XyIdNMgHOvPP3UO57bxpigwRnE1inMt3WN+
Uce/IyPm+EL1QiM7lq+jN6tAzxCCtZjOtAa5SKb52ei6BPWjdH+IUNOnnsSCyFPggpNmVmJNNplY
vOCnTA/f+bHXwJ7phcHchGTQYEeiJgkiacTNH9bWVO8E5Zk7X7BrWnwEeALC5s6jJlMXPFHN9DWK
H/QXo87ZwvyfbwkDKgxW5hgv4VCl/CI1SfmSE6YWwqXdMW5xKDQzqG+Qpa7IVzVnL/Cb/kTV/psw
zYFNAuKeFZjjQ7H78yh1zj4N9IRlw+4S6If225++sOyTV/Y6FYyw+TNhfZfgx/N/34Rs2ApaegCF
LEZ4Wp+olI8EaAmhhrkVRZCPCztcMY7pMDpc/FbGCOIDzcRZObiJbtVNxdEbxOuxOS5G9Nv/Eeci
lmjnJL2SaVXPZIBg5hixL1EL7Tx2hb0C8MZpD5m7QZy9YSMDz0hywNNBREcUj80RYTDboeVYV5uB
RBgf35TUCU6Sxp9jPQmk5MO01YnR0YRYp2buVKfAeJQ8jrguwZl1MFPZv5HHENpcUBCDO+nw6xdn
jkts1HMJHgO47XMxo4uS8UPclBUFe8yqhhNLFkMlXPS9MsU4XCET0BjfIJtxZI6yFdIasPjVYUxG
EEfDsuJIq0gxthcoCI7YueXG3meWgffpc1cwg/2AWwP+tuY2YAQKFRyFOGR4Rp/1dL9orN4SI41a
awkKwtxFduCwJF3Y14+i9LQV2qNaSvYvEjBhGm/lDlfq2Xj/Z5hfj92uODPWfDHS45i6GsZtlx6/
kyjSqDX8WKz2iLDeOQ7vRst6</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soapenv:Body>
</soapenv:Envelope>